import React, { useEffect } from 'react';
import AOS from 'aos';
import 'aos/dist/aos.css';
import './WhyMeSection.css';

const WhyMeSection = () => {
  useEffect(() => {
    AOS.init({
      duration: 1000, 
      once: false,    
    });
  }, []);

  return (
    <div className="Why-me">
      <h1 >Чому я?</h1>
      <div className="Why-me-wrap"></div>
      <ul className="WhyMe-list">
        <li data-aos="fade-up">
        Я той міні бро, у якого завжди загоряються очі,чуючи слово ІТ. Моя мотивація – розвиток і подолання своїх страхів. Я хочу зробити крутецький проєкт, де кожен учасник зможе розкрити себе на повну, а я розвинути свої софт і хард скіли, зміцнювати дух команди і допомагати у важку хвилину. У мене вже було КТ у Олексія Татарчинського та Микити Клименка, після яких вже ознайомлена зі своїми майбутніми обов’язками,а навіть якщо щось буде новим — я не відступлю, бо це саме той досвід, якого я шукала.
        </li>
        <li data-aos="fade-up" data-aos-delay="100">
        До того ж, мені не страшно вчитись, помилятись чи братись за щось нове. Навпаки я кайфую від того, що можу рости. І якщо цей шлях почнеться тут, то я готова зробити свій перший крок на повну. Я марю тим, щоб стати частинкою цієї кортіми, отримати друзів на все життя і з гордістю розказувати, що була айтішніком на ОГО якому івенті.
        </li>
        <li data-aos="fade-up" data-aos-delay="200">
        Наразі я не просто вмотивований обзервер — я людинка,яка горить бажанням вчитись й щодня ставати кращою. Я готова вкладати всі свої сили, аби розвиватись разом із кортімою та зробити внесок у створення НАЙКРАЩОГО другого CTF’y. 
        </li>
      </ul>
    </div>
  );
};

export default WhyMeSection;
