import React from 'react';
import './AboutSection.css';
import PhotoSwiper from '../Photoswiper/Photoswiper';

const AboutSection = () => {
    return (
      <div className="about-section">
        <div className="about-left">
          <PhotoSwiper />  
        </div>
        <div className="about-right">
          <h1 className="zaholovok">Хто я?</h1>
          <p>
          Взагалі, я 17-річна тернопільська панянка, яка полюбляє щось робити в компі. Зараз я навчаюся на першому курсі ПЗ і до недавнього часу я не прагнула займатися чимось поза межами університету. Однак, потрапивши до BEST і працюючи над цією мотивашкою, я відкрила для себе багато нових і цікавих речей. Тепер я знаю: CTF — точно те, у що я хочу зануритись з головою.
          </p>
          <p>
          Я максимально заряджена брати активну участь у технічній частині цієї легенди, навчаючись у процесі та працюючи пліч-о-пліч з командою. І, звісно, завжди готова підтримати кортіму, допомагати з тасками та бути поруч, коли потрібно підставити плече.
          </p>
        </div>
      </div>
    );
  };
  
  export default AboutSection;